NDJSec/FALCON/knowledge_base/svd/data/SiliconLabs/Series1/MGM12/MGM12P02F1024GE.svd
        <register>
          <name>DATA0BYTE</name>
          <description>DATA0 Register Byte Access</description>
          <addressOffset>0x0B0</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x000000FF</resetMask>
          <readAction>modifyExternal</readAction>
          <fields>
            <field>
              <name>DATA0BYTE</name>
              <description>Data 0 Byte Access</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>DATA1BYTE</name>
          <description>DATA1 Register Byte Access</description>
          <addressOffset>0x0B4</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x000000FF</resetMask>
          <readAction>modifyExternal</readAction>
          <fields>
            <field>
              <name>DATA1BYTE</name>
              <description>Data 1 Byte Access</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>DATA0XORBYTE</name>
          <description>DATA0 Register Byte XOR Access</description>
          <addressOffset>0x0BC</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x000000FF</resetMask>
          <readAction>modifyExternal</readAction>
          <fields>
            <field>
              <name>DATA0XORBYTE</name>
              <description>Data 0 XOR Byte Access</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>DATA0BYTE12</name>
          <description>DATA0 Register Byte 12 Access</description>
          <addressOffset>0x0C0</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x000000FF</resetMask>
          <fields>
            <field>
              <name>DATA0BYTE12</name>
              <description>Data 0 Byte 12 Access</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>DATA0BYTE13</name>
          <description>DATA0 Register Byte 13 Access</description>
          <addressOffset>0x0C4</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x000000FF</resetMask>
          <fields>
            <field>
              <name>DATA0BYTE13</name>
              <description>Data 0 Byte 13 Access</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>DATA0BYTE14</name>
          <description>DATA0 Register Byte 14 Access</description>
          <addressOffset>0x0C8</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x000000FF</resetMask>
          <fields>
            <field>
              <name>DATA0BYTE14</name>
              <description>Data 0 Byte 14 Access</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>DATA0BYTE15</name>
          <description>DATA0 Register Byte 15 Access</description>
          <addressOffset>0x0CC</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x000000FF</resetMask>
          <fields>
            <field>
              <name>DATA0BYTE15</name>
              <description>Data 0 Byte 15 Access</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>DDATA0</name>
          <description>DDATA0 Register Access</description>
          <addressOffset>0x100</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <readAction>modifyExternal</readAction>
          <fields>
            <field>
              <name>DDATA0</name>
              <description>Double Data 0 Access</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>DDATA1</name>
          <description>DDATA1 Register Access</description>
          <addressOffset>0x104</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <readAction>modifyExternal</readAction>
          <fields>
            <field>
              <name>DDATA1</name>
              <description>Double Data 0 Access</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>DDATA2</name>
          <description>DDATA2 Register Access</description>
          <addressOffset>0x108</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <readAction>modifyExternal</readAction>
          <fields>
            <field>
              <name>DDATA2</name>
              <description>Double Data 0 Access</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>DDATA3</name>
          <description>DDATA3 Register Access</description>
          <addressOffset>0x10C</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <readAction>modifyExternal</readAction>
          <fields>
            <field>
              <name>DDATA3</name>
              <description>Double Data 0 Access</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>DDATA4</name>
          <description>DDATA4 Register Access</description>
          <addressOffset>0x110</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <readAction>modifyExternal</readAction>
          <fields>
            <field>
              <name>DDATA4</name>
              <description>Double Data 0 Access</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>DDATA0BIG</name>
          <description>DDATA0 Register Big Endian Access</description>
          <addressOffset>0x130</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <readAction>modifyExternal</readAction>
          <fields>
            <field>
              <name>DDATA0BIG</name>
              <description>Double Data 0 Big Endian Access</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>DDATA0BYTE</name>
          <description>DDATA0 Register Byte Access</description>
          <addressOffset>0x140</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x000000FF</resetMask>
          <readAction>modifyExternal</readAction>
          <fields>
            <field>
              <name>DDATA0BYTE</name>
              <description>Ddata 0 Byte Access</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>DDATA1BYTE</name>
          <description>DDATA1 Register Byte Access</description>
          <addressOffset>0x144</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x000000FF</resetMask>
          <readAction>modifyExternal</readAction>
          <fields>
            <field>
              <name>DDATA1BYTE</name>
              <description>Ddata 1 Byte Access</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>DDATA0BYTE32</name>
          <description>DDATA0 Register Byte 32 Access</description>
          <addressOffset>0x148</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x0000000F</resetMask>
          <fields>
            <field>
              <name>DDATA0BYTE32</name>
              <description>Ddata 0 Byte 32 Access</description>
              <bitOffset>0</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>QDATA0</name>
          <description>QDATA0 Register Access</description>
          <addressOffset>0x180</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <readAction>modifyExternal</readAction>
          <fields>
            <field>
              <name>QDATA0</name>
              <description>Quad Data 0 Access</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>QDATA1</name>
          <description>QDATA1 Register Access</description>
          <addressOffset>0x184</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <readAction>modifyExternal</readAction>
          <fields>
            <field>
              <name>QDATA1</name>
              <description>Quad Data 1 Access</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>QDATA1BIG</name>
          <description>QDATA1 Register Big Endian Access</description>
          <addressOffset>0x1A4</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <readAction>modifyExternal</readAction>
          <fields>
            <field>
              <name>QDATA1BIG</name>
              <description>Quad Data 1 Big Endian Access</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>QDATA0BYTE</name>
          <description>QDATA0 Register Byte Access</description>
          <addressOffset>0x1C0</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x000000FF</resetMask>
          <readAction>modifyExternal</readAction>
          <fields>
            <field>
              <name>QDATA0BYTE</name>
              <description>Qdata 0 Byte Access</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>QDATA1BYTE</name>
          <description>QDATA1 Register Byte Access</description>
          <addressOffset>0x1C4</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x000000FF</resetMask>
          <readAction>modifyExternal</readAction>
          <fields>
            <field>
              <name>QDATA1BYTE</name>
              <description>Qdata 1 Byte Access</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
